using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Exer10
{
    class Program
    {
        /* Даны два прямоугольника, стороны которых параллельны или перпендикулярны осям координат. 
           Известны координаты левого нижнего угла каждого из них и длины их сторон. 
           Один из прямоугольников назовем первым, другой — вторым.
           а) Определить, принадлежат ли все точки первого прямоугольника второму.
           б) Определить, принадлежат ли все точки одного из прямоугольников другому.
           в) Определить, пересекаются ли эти прямоугольники.
         */
        static void Main(string[] args)
        {
        }
    }
}
