using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace ConAppIteaMethod
{
    class Program
    {
        static void Main(string[] args)
        {
            /*
            МЕТОДЫ. РЕКУРСИЯ

ЗАДАЧА №1
Лесенкой называется набор кубиков, в котором каждый более верхний слой содержит кубиков меньше, чем предыдущий. Требуется написать программу, вычисляющую число лесенок, которое можно построить из N кубиков. (Использовать рекурсию для решения этой задачи).

ЗАДАЧА №2
Заданы три числа: a, b, c. Необходимо выяснить, можно ли так переставить цифры в числах a и b, чтобы в сумме получилось c.

ЗАДАЧА №3
Дана строка, состоящая из N попарно различных символов. Требуется вывести все перестановки символов данной строки.

ЗАДАЧА №4
По заданному числу N вычислить число Фибоначчи F(N).

ЗАДАЧА №5
Имеется три стержня, на один из которых нанизаны N колец, причем кольца отличаются размером и лежат меньшее на большем. Требуется перенести пирамиду из N колец с одного стержня на другой за наименьшее число ходов. За один раз разрешается переносить только одно кольцо, причём нельзя класть большее кольцо на меньшее.

ЗАДАЧА №6
Рекурсивно описать функцию pow(x,n), вычисляющую x n для любого вещественного x (≠0) и любого целого n.


ЗАДАЧА №7
9. Рекурсивно описать функцию divs(N) для подсчета количества всех делителей целого числа N (N>1), без учета делителей 1 и N. Например: divs(5)=0, divs(18)=4
            */
        }
    }
}
